replacing mermaid diagram
